In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn
from sklearn.preprocessing import LabelEncoder

In [2]:
ls

 Volume in drive C is OS
 Volume Serial Number is A09C-8A30

 Directory of C:\Users\Ahmed-Basem\Desktop\Current\Corelia\Task Two

05/03/2023  05:23 PM    <DIR>          .
05/03/2023  05:23 PM    <DIR>          ..
05/03/2023  05:23 PM    <DIR>          .ipynb_checkpoints
03/01/2021  06:50 AM           530,389 Data_Train.xlsx
05/02/2023  09:53 PM         7,803,486 Regression.ipynb
02/15/2020  09:10 AM           120,774 Test_set.xlsx
               3 File(s)      8,454,649 bytes
               3 Dir(s)  25,922,035,712 bytes free

In [3]:
data = pd.read_excel('Data_Train.xlsx')
data.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

### Get insights about the dataset

In [4]:
print(f"There are {data.shape[0]} Rows and {data.shape[1]} Columns in our dataset")

There are 10683 Rows and 11 Columns in our dataset

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [6]:
# get the count of null values in every column in our dataset
data.isnull().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              1
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        1
Additional_Info    0
Price              0
dtype: int64

In [7]:
data = data.dropna()

In [8]:
data.isnull().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              0
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        0
Additional_Info    0
Price              0
dtype: int64

In [9]:
def get_insights(column):
    print(f"Columns in {column}")
    print("most appeared values")
    print(data[column].value_counts().index[:5])
    print(f"Number of unique values is {data[column].nunique()}")
    print('\n #### Random Values ####')
    print(data.sample(5)[column].values)

In [10]:
get_insights('Airline')

Columns in Airline
most appeared values
Index(['Jet Airways', 'IndiGo', 'Air India', 'Multiple carriers', 'SpiceJet'], dtype='object')
Number of unique values is 12

 #### Random Values ####
['IndiGo' 'Vistara' 'IndiGo' 'Jet Airways' 'SpiceJet']

In [11]:
data.groupby('Airline').mean()

                                          Price
Airline
Air Asia                            5590.260188
Air India                           9612.427756
GoAir                               5861.056701
IndiGo                              5673.682903
Jet Airways                        11643.923357
Jet Airways Business               58358.666667
Multiple carriers                  10902.678094
Multiple carriers Premium economy  11418.846154
SpiceJet                            4338.284841
Trujet                              4140.000000
Vistara                             7796.348643
Vistara Premium economy             8962.333333

In [12]:
get_insights('Date_of_Journey')

Columns in Date_of_Journey
most appeared values
Index(['18/05/2019', '6/06/2019', '21/05/2019', '9/06/2019', '12/06/2019'], dtype='object')
Number of unique values is 44

 #### Random Values ####
['21/05/2019' '1/06/2019' '9/04/2019' '6/05/2019' '9/04/2019']

In [13]:
data['day'] = data['Date_of_Journey'].apply(lambda x:int(x.split('/')[0]))
data['month'] = data['Date_of_Journey'].apply(lambda x:int(x.split('/')[1]))
data['year'] = data['Date_of_Journey'].apply(lambda x:int(x.split('/')[2]))
data = data.drop('Date_of_Journey',axis=1)

In [14]:
data.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,day,month,year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882,9,6,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218,12,5,2019
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302,1,3,2019

In [15]:
get_insights('Source')

Columns in Source
most appeared values
Index(['Delhi', 'Kolkata', 'Banglore', 'Mumbai', 'Chennai'], dtype='object')
Number of unique values is 5

 #### Random Values ####
['Delhi' 'Delhi' 'Delhi' 'Banglore' 'Mumbai']

In [16]:
data.groupby('Source').mean()

                 Price        day     month    year
Source
Banglore   8017.464269  12.668639  4.149294  2019.0
Chennai    4789.892388  13.800525  4.742782  2019.0
Delhi     10540.113536  14.496914  4.897266  2019.0
Kolkata    9158.389411  12.662139  4.876001  2019.0
Mumbai     5059.708752  13.058824  4.535151  2019.0

In [17]:
get_insights('Destination')

Columns in Destination
most appeared values
Index(['Cochin', 'Banglore', 'Delhi', 'New Delhi', 'Hyderabad'], dtype='object')
Number of unique values is 6

 #### Random Values ####
['Cochin' 'Banglore' 'Hyderabad' 'Banglore' 'Cochin']

In [18]:
data.groupby('Destination').mean()

                    Price        day     month    year
Destination
Banglore      9158.389411  12.662139  4.876001  2019.0
Cochin       10540.113536  14.496914  4.897266  2019.0
Delhi         5143.918577  13.569960  4.996047  2019.0
Hyderabad     5059.708752  13.058824  4.535151  2019.0
Kolkata       4789.892388  13.800525  4.742782  2019.0
New Delhi    11917.716738  11.445279  3.000000  2019.0

In [19]:
get_insights('Route')

Columns in Route
most appeared values
Index(['DEL → BOM → COK', 'BLR → DEL', 'CCU → BOM → BLR', 'CCU → BLR',
       'BOM → HYD'],
      dtype='object')
Number of unique values is 128

 #### Random Values ####
['BLR → DEL' 'DEL → BOM → COK' 'DEL → ATQ → BOM → COK' 'DEL → BOM → COK'
 'BLR → DEL']

In [20]:
data['Route'].unique()

array(['BLR → DEL', 'CCU → IXR → BBI → BLR', 'DEL → LKO → BOM → COK',
       'CCU → NAG → BLR', 'BLR → NAG → DEL', 'CCU → BLR',
       'BLR → BOM → DEL', 'DEL → BOM → COK', 'DEL → BLR → COK',
       'MAA → CCU', 'CCU → BOM → BLR', 'DEL → AMD → BOM → COK',
       'DEL → PNQ → COK', 'DEL → CCU → BOM → COK', 'BLR → COK → DEL',
       'DEL → IDR → BOM → COK', 'DEL → LKO → COK',
       'CCU → GAU → DEL → BLR', 'DEL → NAG → BOM → COK',
       'CCU → MAA → BLR', 'DEL → HYD → COK', 'CCU → HYD → BLR',
       'DEL → COK', 'CCU → DEL → BLR', 'BLR → BOM → AMD → DEL',
       'BOM → DEL → HYD', 'DEL → MAA → COK', 'BOM → HYD',
       'DEL → BHO → BOM → COK', 'DEL → JAI → BOM → COK',
       'DEL → ATQ → BOM → COK', 'DEL → JDH → BOM → COK',
       'CCU → BBI → BOM → BLR', 'BLR → MAA → DEL',
       'DEL → GOI → BOM → COK', 'DEL → BDQ → BOM → COK',
       'CCU → JAI → BOM → BLR', 'CCU → BBI → BLR', 'BLR → HYD → DEL',
       'DEL → TRV → COK', 'CCU → IXR → DEL → BLR',
       'DEL → IXU → BOM → COK', 'CCU → IXB → BLR',
       'BLR → BOM → JDH → DEL', 'DEL → UDR → BOM → COK',
       'DEL → HYD → MAA → COK', 'CCU → BOM → COK → BLR',
       'BLR → CCU → DEL', 'CCU → BOM → GOI → BLR',
       'DEL → RPR → NAG → BOM → COK', 'DEL → HYD → BOM → COK',
       'CCU → DEL → AMD → BLR', 'CCU → PNQ → BLR',
       'BLR → CCU → GAU → DEL', 'CCU → DEL → COK → BLR',
       'BLR → PNQ → DEL', 'BOM → JDH → DEL → HYD',
       'BLR → BOM → BHO → DEL', 'DEL → AMD → COK', 'BLR → LKO → DEL',
       'CCU → GAU → BLR', 'BOM → GOI → HYD', 'CCU → BOM → AMD → BLR',
       'CCU → BBI → IXR → DEL → BLR', 'DEL → DED → BOM → COK',
       'DEL → MAA → BOM → COK', 'BLR → AMD → DEL', 'BLR → VGA → DEL',
       'CCU → JAI → DEL → BLR', 'CCU → AMD → BLR',
       'CCU → VNS → DEL → BLR', 'BLR → BOM → IDR → DEL',
       'BLR → BBI → DEL', 'BLR → GOI → DEL', 'BOM → AMD → ISK → HYD',
       'BOM → DED → DEL → HYD', 'DEL → IXC → BOM → COK',
       'CCU → PAT → BLR', 'BLR → CCU → BBI → DEL',
       'CCU → BBI → HYD → BLR', 'BLR → BOM → NAG → DEL',
       'BLR → CCU → BBI → HYD → DEL', 'BLR → GAU → DEL',
       'BOM → BHO → DEL → HYD', 'BOM → JLR → HYD',
       'BLR → HYD → VGA → DEL', 'CCU → KNU → BLR',
       'CCU → BOM → PNQ → BLR', 'DEL → BBI → COK',
       'BLR → VGA → HYD → DEL', 'BOM → JDH → JAI → DEL → HYD',
       'DEL → GWL → IDR → BOM → COK', 'CCU → RPR → HYD → BLR',
       'CCU → VTZ → BLR', 'CCU → DEL → VGA → BLR',
       'BLR → BOM → IDR → GWL → DEL', 'CCU → DEL → COK → TRV → BLR',
       'BOM → COK → MAA → HYD', 'BOM → NDC → HYD', 'BLR → BDQ → DEL',
       'CCU → BOM → TRV → BLR', 'CCU → BOM → HBX → BLR',
       'BOM → BDQ → DEL → HYD', 'BOM → CCU → HYD',
       'BLR → TRV → COK → DEL', 'BLR → IDR → DEL',
       'CCU → IXZ → MAA → BLR', 'CCU → GAU → IMF → DEL → BLR',
       'BOM → GOI → PNQ → HYD', 'BOM → BLR → CCU → BBI → HYD',
       'BOM → MAA → HYD', 'BLR → BOM → UDR → DEL',
       'BOM → UDR → DEL → HYD', 'BLR → VGA → VTZ → DEL',
       'BLR → HBX → BOM → BHO → DEL', 'CCU → IXA → BLR',
       'BOM → RPR → VTZ → HYD', 'BLR → HBX → BOM → AMD → DEL',
       'BOM → IDR → DEL → HYD', 'BOM → BLR → HYD', 'BLR → STV → DEL',
       'CCU → IXB → DEL → BLR', 'BOM → JAI → DEL → HYD',
       'BOM → VNS → DEL → HYD', 'BLR → HBX → BOM → NAG → DEL',
       'BLR → BOM → IXC → DEL', 'BLR → CCU → BBI → HYD → VGA → DEL',
       'BOM → BBI → HYD'], dtype=object)

In [21]:
def route_len(route):
    try:
        route = len(route.split('→'))
        return route
    except:
        print(route)
        return 0

In [22]:
# data['route_len'] = data['Route'].apply(route_len)

In [23]:
data.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,day,month,year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882,9,6,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218,12,5,2019
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302,1,3,2019

In [24]:
data = data.drop(['Dep_Time','Arrival_Time','Route'],axis=1)

In [25]:
get_insights('Duration')

Columns in Duration
most appeared values
Index(['2h 50m', '1h 30m', '2h 45m', '2h 55m', '2h 35m'], dtype='object')
Number of unique values is 368

 #### Random Values ####
['25h 45m' '3h' '22h 55m' '2h 40m' '2h 25m']

In [26]:
def convert_time_minute(time):
    if "m" in time:
        time = time.replace('m',"")
        if "h" not in time:
            hours = 0
            mintues = time.split(" ")[0]
        else:
            time = time.replace('h',"")
            hours = time.split(" ")[0]
            mintues = time.split(" ")[1]
        total = int(hours) * 60 + int(mintues)
    else:
        time = time.replace('h',"")
        total = int(time) * 60

    
    
    return total

In [27]:
data['Duration'] = data['Duration'].apply(convert_time_minute)

In [28]:
data.head()

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,day,month,year
0,IndiGo,Banglore,New Delhi,170,non-stop,No info,3897,24,3,2019
1,Air India,Kolkata,Banglore,445,2 stops,No info,7662,1,5,2019
2,Jet Airways,Delhi,Cochin,1140,2 stops,No info,13882,9,6,2019
3,IndiGo,Kolkata,Banglore,325,1 stop,No info,6218,12,5,2019
4,IndiGo,Banglore,New Delhi,285,1 stop,No info,13302,1,3,2019

In [29]:
get_insights('Total_Stops')

Columns in Total_Stops
most appeared values
Index(['1 stop', 'non-stop', '2 stops', '3 stops', '4 stops'], dtype='object')
Number of unique values is 5

 #### Random Values ####
['1 stop' '2 stops' '1 stop' '1 stop' '1 stop']

In [30]:
def convert_stops_int(stops):
    if "1" in stops:
        return  1
    elif "2" in stops:
        return 2
    elif "3" in stops:
        return 3
    elif "4" in stops:
        return 4
    else:
        return 0

In [31]:
data['Total_Stops'] = data['Total_Stops'].apply(convert_stops_int)

In [32]:
data.head()

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,day,month,year
0,IndiGo,Banglore,New Delhi,170,0,No info,3897,24,3,2019
1,Air India,Kolkata,Banglore,445,2,No info,7662,1,5,2019
2,Jet Airways,Delhi,Cochin,1140,2,No info,13882,9,6,2019
3,IndiGo,Kolkata,Banglore,325,1,No info,6218,12,5,2019
4,IndiGo,Banglore,New Delhi,285,1,No info,13302,1,3,2019

In [33]:
get_insights('Additional_Info')

Columns in Additional_Info
most appeared values
Index(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Long layover', 'Change airports'],
      dtype='object')
Number of unique values is 10

 #### Random Values ####
['No info' 'In-flight meal not included' 'No info' 'No info' 'No info']

In [34]:
data['Additional_Info'].value_counts()

No info                         8344
In-flight meal not included     1982
No check-in baggage included     320
1 Long layover                    19
Change airports                    7
Business class                     4
No Info                            3
1 Short layover                    1
Red-eye flight                     1
2 Long layover                     1
Name: Additional_Info, dtype: int64

In [35]:
data.groupby('Additional_Info').mean()['Price']

Additional_Info
1 Long layover                  22109.631579
1 Short layover                 26743.000000
2 Long layover                  26480.000000
Business class                  56811.250000
Change airports                 16800.714286
In-flight meal not included      9471.834511
No Info                          8044.666667
No check-in baggage included     3645.156250
No info                          9141.519295
Red-eye flight                  10873.000000
Name: Price, dtype: float64

In [36]:
data['Additional_Info'].dtype

dtype('O')

In [37]:
categorical = [col for col in data.columns if data[col].dtype == "O"]
categorical

['Airline', 'Source', 'Destination', 'Additional_Info']

In [195]:
for col in categorical:
    print(col + " has : " + str(data[col].nunique()))

Airline has : 12
Source has : 5
Destination has : 6
Additional_Info has : 10

In [39]:
data.shape

(10682, 10)

In [40]:
def encode_data(encoder,col):
    encoded_data = encoder.fit_transform(data[col])
    return encoded_data

In [41]:
airline_encoder,source_encoder,destination_encoder,info_encoder = LabelEncoder(),LabelEncoder(),LabelEncoder(),LabelEncoder()

In [42]:
data['Airline']= encode_data(airline_encoder,'Airline')
data['Source']= encode_data(source_encoder,'Source')
data['Destination']= encode_data(destination_encoder,'Destination')
data['Additional_Info']= encode_data(info_encoder,'Additional_Info')

In [43]:
data.head()

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,day,month,year
0,3,0,5,170,0,8,3897,24,3,2019
1,1,3,0,445,2,8,7662,1,5,2019
2,4,2,1,1140,2,8,13882,9,6,2019
3,3,3,0,325,1,8,6218,12,5,2019
4,3,0,5,285,1,8,13302,1,3,2019

In [44]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  int32
 1   Source           10682 non-null  int32
 2   Destination      10682 non-null  int32
 3   Duration         10682 non-null  int64
 4   Total_Stops      10682 non-null  int64
 5   Additional_Info  10682 non-null  int32
 6   Price            10682 non-null  int64
 7   day              10682 non-null  int64
 8   month            10682 non-null  int64
 9   year             10682 non-null  int64
dtypes: int32(4), int64(6)
memory usage: 751.1 KB

In [45]:
X = data.drop('Price',axis=1).values
Y = data['Price'].values

In [171]:
class LinearRegression():
    
    def __init__(self,lr,iterations):
        
        self.lr = lr
        self.iterations = iterations
    
    def fit(self,X,Y):
        n_samples , n_features = X.shape
        
        self.weights = np.random.randn(n_features)
        self.bais = 0
        
        for i in range(self.iterations):
            y_pred = np.dot(X,self.weights) + self.bais

            error = y_pred - Y

            dW = (1 / n_samples) * np.dot(X.T,error)
            db = (1 / n_samples) * np.sum(error)

            self.weights = self.weights - self.lr * dW
            self.bais = self.bais - self.lr * db
            
    def predict(self,X):
        
        net = np.dot(X,self.weights) + self.bais
        
        return net

In [190]:
lr = LinearRegression(.001,2)
lr.fit(X,Y)

In [191]:
lr.predict(X)[0]

-2761972559263291.5

In [179]:
Y[0]

3897